# PoissonRatio Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralAsset..::..PoissonRatio Property
StructuralAsset Class See Also
---
The Poisson ratio of the asset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public XYZ PoissonRatio { get; set; }
```

Visual Basic
---
```text
Public Property PoissonRatio As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ PoissonRatio {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Remarks
This property cannot be used to set the Poisson ratio for wood-based and isotropic materials. For such assets, use setPoissonRatio instead.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | When setting this property: the material type is wood. -or- When setting this property: the behavior is isotropic. |

# See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace